WestlakeGit/recorded_traffic/BookstoreProxy_2015-06-30_14-54-38-527.txt

POST /bookstoreProxy HTTP/1.0
content-type: text/xml; charset=UTF-8
host: localhost:9080
soapaction: ""
content-length: 396

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <getItemByTitle xmlns="http://bookstore.parasoft.com/">
   <titleKeyword xmlns="">java</titleKeyword>
  </getItemByTitle>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

HTTP/1.1 200 OK
Date: Tue, 30 Jun 2015 19:52:54 GMT
Content-Length: 1032
Connection: close
Content-Type: text/xml;charset=UTF-8
Server: Apache-Coyote/1.1

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:getItemByTitleResponse xmlns:ns2="http://bookstore.parasoft.com/"><book><id>2</id><name>Java How to Program (4th Edition)</name><price>38926.00</price><stockQuantity>10</stockQuantity><authors>Harvey M. Deitel</authors><authors>Paul J. Deitel</authors><description>Great for Java beginners</description><ISBN>0130341517</ISBN><publicationDate>2001-08-08T00:00:00-07:00</publicationDate><publisher>Prentice Hall</publisher></book><book><id>3</id><name>Java in a Nutshell, Fourth Edition</name><price>38877.97</price><stockQuantity>5</stockQuantity><authors>David Flanagan</authors><description>contains an accelerated introduction to the Java programming language and its key APIs so you can start writing code right away. Covers Java 1.4</description><ISBN>0596002831</ISBN><publicationDate>2002-03-01T00:00:00-08:00</publicationDate><publisher>O'Reilly &amp; Associates</publisher></book></ns2:getItemByTitleResponse></soap:Body></soap:Envelope>

POST /bookstoreProxy HTTP/1.0
content-type: text/xml; charset=UTF-8
host: localhost:9080
soapaction: ""
content-length: 414

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <addItemToCart xmlns="http://bookstore.parasoft.com/">
   <itemId xmlns="">2</itemId>
   <quantity xmlns="">1</quantity>
  </addItemToCart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

HTTP/1.1 200 OK
Date: Tue, 30 Jun 2015 19:52:54 GMT
Content-Length: 646
Connection: close
Content-Type: text/xml;charset=UTF-8
Server: Apache-Coyote/1.1

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:addItemToCartResponse xmlns:ns2="http://bookstore.parasoft.com/"><itemAdded><cartId>4059</cartId><item><book><id>2</id><name>Java How to Program (4th Edition)</name><price>76.00</price><stockQuantity>10</stockQuantity><authors>Harvey M. Deitel</authors><authors>Paul J. Deitel</authors><description>Great for Java beginners</description><ISBN>0130341517</ISBN><publicationDate>2001-08-08T00:00:00-07:00</publicationDate><publisher>Prentice Hall</publisher></book><quantity>1</quantity></item></itemAdded></ns2:addItemToCartResponse></soap:Body></soap:Envelope>

POST /bookstoreProxy HTTP/1.0
content-type: text/xml; charset=UTF-8
host: localhost:9080
soapaction: ""
content-length: 378

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <submitOrder xmlns="http://bookstore.parasoft.com/">
   <cartId xmlns="">4059</cartId>
  </submitOrder>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

HTTP/1.1 200 OK
Date: Tue, 30 Jun 2015 19:52:54 GMT
Content-Length: 315
Connection: close
Content-Type: text/xml;charset=UTF-8
Server: Apache-Coyote/1.1

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:submitOrderResponse xmlns:ns2="http://bookstore.parasoft.com/"><orderInformation><orderTime>2015-06-30T12:52:55.293-07:00</orderTime><success>true</success></orderInformation></ns2:submitOrderResponse></soap:Body></soap:Envelope>

POST /bookstoreProxy HTTP/1.0
content-type: text/xml; charset=UTF-8
host: localhost:9080
soapaction: ""
content-length: 395

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <getItemByTitle xmlns="http://bookstore.parasoft.com/">
   <titleKeyword xmlns="">c++</titleKeyword>
  </getItemByTitle>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

HTTP/1.1 200 OK
Date: Tue, 30 Jun 2015 19:52:54 GMT
Content-Length: 572
Connection: close
Content-Type: text/xml;charset=UTF-8
Server: Apache-Coyote/1.1

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:getItemByTitleResponse xmlns:ns2="http://bookstore.parasoft.com/"><book><id>1</id><name>C++ How to Program (4th Edition)</name><price>38949.99</price><stockQuantity>20</stockQuantity><authors>Harvey M. Deitel</authors><authors>Paul J. Deitel</authors><description>One of the best C++ books</description><ISBN>0130384747</ISBN><publicationDate>2002-08-12T00:00:00-07:00</publicationDate><publisher>Prentice Hall</publisher></book></ns2:getItemByTitleResponse></soap:Body></soap:Envelope>

POST /bookstoreProxy HTTP/1.0
content-type: text/xml; charset=UTF-8
host: localhost:9080
soapaction: ""
content-length: 414

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <addItemToCart xmlns="http://bookstore.parasoft.com/">
   <itemId xmlns="">1</itemId>
   <quantity xmlns="">1</quantity>
  </addItemToCart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

HTTP/1.1 200 OK
Date: Tue, 30 Jun 2015 19:52:55 GMT
Content-Length: 646
Connection: close
Content-Type: text/xml;charset=UTF-8
Server: Apache-Coyote/1.1

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:addItemToCartResponse xmlns:ns2="http://bookstore.parasoft.com/"><itemAdded><cartId>4060</cartId><item><book><id>1</id><name>C++ How to Program (4th Edition)</name><price>99.99</price><stockQuantity>20</stockQuantity><authors>Harvey M. Deitel</authors><authors>Paul J. Deitel</authors><description>One of the best C++ books</description><ISBN>0130384747</ISBN><publicationDate>2002-08-12T00:00:00-07:00</publicationDate><publisher>Prentice Hall</publisher></book><quantity>1</quantity></item></itemAdded></ns2:addItemToCartResponse></soap:Body></soap:Envelope>

POST /bookstoreProxy HTTP/1.0
content-type: text/xml; charset=UTF-8
host: localhost:9080
soapaction: ""
content-length: 378

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <submitOrder xmlns="http://bookstore.parasoft.com/">
   <cartId xmlns="">4060</cartId>
  </submitOrder>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

HTTP/1.1 200 OK
Date: Tue, 30 Jun 2015 19:52:55 GMT
Content-Length: 315
Connection: close
Content-Type: text/xml;charset=UTF-8
Server: Apache-Coyote/1.1

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:submitOrderResponse xmlns:ns2="http://bookstore.parasoft.com/"><orderInformation><orderTime>2015-06-30T12:52:56.029-07:00</orderTime><success>true</success></orderInformation></ns2:submitOrderResponse></soap:Body></soap:Envelope>

POST /bookstoreProxy HTTP/1.0
content-type: text/xml; charset=UTF-8
host: localhost:9080
soapaction: ""
content-length: 397

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <getItemByTitle xmlns="http://bookstore.parasoft.com/">
   <titleKeyword xmlns="">linux</titleKeyword>
  </getItemByTitle>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

HTTP/1.1 200 OK
Date: Tue, 30 Jun 2015 19:52:55 GMT
Content-Length: 724
Connection: close
Content-Type: text/xml;charset=UTF-8
Server: Apache-Coyote/1.1

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:getItemByTitleResponse xmlns:ns2="http://bookstore.parasoft.com/"><book><id>4</id><name>Linux Administration Handbook</name><price>38900.99</price><stockQuantity>3</stockQuantity><authors>Evi Nemeth</authors><authors>Garth Snyder</authors><authors>Trent R. Hein</authors><authors>Adam Boggs</authors><description>Provides techniques and advice for administering three representative distributions Linux: Red Hat 7.2, SuSE 7.3, and Debian 3.0</description><ISBN>0130084662</ISBN><publicationDate>2002-03-25T00:00:00-08:00</publicationDate><publisher>Prentice Hall</publisher></book></ns2:getItemByTitleResponse></soap:Body></soap:Envelope>

POST /bookstoreProxy HTTP/1.0
content-type: text/xml; charset=UTF-8
host: localhost:9080
soapaction: ""
content-length: 414

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <addItemToCart xmlns="http://bookstore.parasoft.com/">
   <itemId xmlns="">4</itemId>
   <quantity xmlns="">1</quantity>
  </addItemToCart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

HTTP/1.1 200 OK
Date: Tue, 30 Jun 2015 19:52:55 GMT
Content-Length: 798
Connection: close
Content-Type: text/xml;charset=UTF-8
Server: Apache-Coyote/1.1

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:addItemToCartResponse xmlns:ns2="http://bookstore.parasoft.com/"><itemAdded><cartId>4061</cartId><item><book><id>4</id><name>Linux Administration Handbook</name><price>49.99</price><stockQuantity>3</stockQuantity><authors>Evi Nemeth</authors><authors>Garth Snyder</authors><authors>Trent R. Hein</authors><authors>Adam Boggs</authors><description>Provides techniques and advice for administering three representative distributions Linux: Red Hat 7.2, SuSE 7.3, and Debian 3.0</description><ISBN>0130084662</ISBN><publicationDate>2002-03-25T00:00:00-08:00</publicationDate><publisher>Prentice Hall</publisher></book><quantity>1</quantity></item></itemAdded></ns2:addItemToCartResponse></soap:Body></soap:Envelope>

POST /bookstoreProxy HTTP/1.0
content-type: text/xml; charset=UTF-8
host: localhost:9080
soapaction: ""
content-length: 378

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <submitOrder xmlns="http://bookstore.parasoft.com/">
   <cartId xmlns="">4061</cartId>
  </submitOrder>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

HTTP/1.1 200 OK
Date: Tue, 30 Jun 2015 19:52:55 GMT
Content-Length: 315
Connection: close
Content-Type: text/xml;charset=UTF-8
Server: Apache-Coyote/1.1

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:submitOrderResponse xmlns:ns2="http://bookstore.parasoft.com/"><orderInformation><orderTime>2015-06-30T12:52:56.750-07:00</orderTime><success>true</success></orderInformation></ns2:submitOrderResponse></soap:Body></soap:Envelope>

